export const HeroType = {
    1: {
        name: '普通',
        color: 'green'
    },
    2: {
        name: '罕见',
        color: 'purple'
    },
    3: {
        name: '特别',
        color: 'yellow'
    },
    4: {
        name: '稀有',
        color: 'pink'
    },
    5: {
        name: '传说',
        color: 'red'
    },
    6: {
        name: '隐藏',
        color: 'grey'
    },
    7: {
        name: '超凡',
        color: 'blue'
    },
    8: {
        name: '不朽',
        color: 'gold'
    },
    9: {
        name: '永恒',
        color: 'black'
    }
}

export const SpecialMap = [];

const Pool1 = [
    {
        name: '蒙奇D路飞',
        type: 1,
        need: []
    },
    {
        name: '娜美',
        type: 1,
        need: []
    },
    {
        name: '罗罗诺亚索隆',
        type: 1,
        need: []
    },
    {
        name: '乌索普',
        type: 1,
        need: []
    },
    {
        name: '海军剑兵',
        type: 1,
        need: []
    },
    {
        name: '海军炮兵',
        type: 1,
        need: []
    },
    {
        name: '巴基',
        type: 1,
        need: []
    },
    {
        name: '山治',
        type: 1,
        need: []
    },

    {
        name: '托尼托尼乔巴',
        type: 1,
        need: []
    },
]

const Pool2 = [
    {
        name: '波特卡斯D艾斯',
        type: 2,
        need: ['蒙奇D路飞', '海军炮兵']
    },
    {
        name: '妮可罗宾',
        type: 2,
        need: ['娜美', '山治']
    },
    {
        name: '布鲁克',
        type: 2,
        need: ['罗罗诺亚索隆', '托尼托尼乔巴']
    },
    {
        name: '狙击王乌索普',
        type: 2,
        need: ['乌索普', '乌索普']
    },
    {
        name: '弗兰奇',
        type: 2,
        need: ['乌索普', '蒙奇D路飞']
    },
    {
        name: 'CP9猫头鹰',
        type: 2,
        need: ['海军剑兵', '海军剑兵']
    },
    {
        name: 'CP9布鲁诺',
        type: 2,
        need: ['海军炮兵', '海军炮兵']
    },
    {
        name: '达斯琪',
        type: 2,
        need: ['海军剑兵', '海军炮兵']
    },
    {
        name: '小八',
        type: 2,
        need: ['海军炮兵', '娜美']
    },
    {
        name: '佩罗娜',
        type: 2,
        need: ['巴基', '娜美']
    },
    {
        name: '依玛祖娜',
        type: 2,
        need: ['山治', '罗罗诺亚索隆']
    },
    {
        name: '培波',
        type: 2,
        need: ['托尼托尼乔巴', '蒙奇D路飞']
    },
    {
        name: '托尼托尼乔巴蓝波球强化',
        type: 2,
        need: ['托尼托尼乔巴', '托尼托尼乔巴']
    },
]

const Pool3 = [
    {
        name: '蒙奇D路飞 二档',
        type: 3,
        need: ['蒙奇D路飞', '蒙奇D路飞', '蒙奇D路飞']
    },
    {
        name: '娜美 天候棒',
        type: 3,
        need: ['娜美', '娜美', '娜美']
    },
    {
        name: '山治黑足',
        type: 3,
        need: ['山治', '山治', '山治']
    },
    {
        name: '罗罗诺亚索隆鬼气',
        type: 3,
        need: ['罗罗诺亚索隆', '罗罗诺亚索隆', '罗罗诺亚索隆']
    },
    {
        name: '巴基特制巴基炮弹',
        type: 3,
        need: ['巴基', '巴基', '巴基']
    },
    {
        name: '妮可罗宾 奥哈拉的恶魔',
        type: 3,
        need: ['妮可罗宾', '妮可罗宾', '托尼托尼乔巴']
    },
    {
        name: '马尔高 白胡子海贼团',
        type: 3,
        need: ['CP9布鲁诺', '波特卡斯D艾斯', '山治']
    },
    {
        name: '加卡 阿拉巴斯坦守护神',
        type: 3,
        need: ['CP9布鲁诺', 'CP9猫头鹰', '托尼托尼乔巴']
    },
    {
        name: '罗布路奇 CP9 道力 4000',
        type: 3,
        need: ['CP9猫头鹰', '妮可罗宾', '蒙奇D路飞']
    },
    {
        name: '卡彭匪帮贝基',
        type: 3,
        need: ['CP9猫头鹰', '海军炮兵', '巴基']
    },
    {
        name: '特拉法尔加罗',
        type: 3,
        need: ['培波', '达斯琪', '巴基']
    },
    {
        name: '巴索罗缪熊',
        type: 3,
        need: ['培波', '弗兰奇', '罗罗诺亚索隆']
    },
    {
        name: 'X德雷克',
        type: 3,
        need: ['达斯琪', 'CP9猫头鹰', '托尼托尼乔巴']
    },
    {
        name: '基拉',
        type: 3,
        need: ['达斯琪', '布鲁克', '巴基']
    },
    {
        name: '斯摩格',
        type: 3,
        need: ['海军炮兵', '达斯琪', '海军剑兵']
    },
    {
        name: '本萨姆Mr.2',
        type: 3,
        need: ['依玛祖娜', '妮可罗宾', '娜美']
    },
    {
        name: '依玛祖娜革命军',
        type: 3,
        need: ['依玛祖娜', '依玛祖娜']
    },
    {
        name: '海贼5号合体 巨大机器战士',
        type: 3,
        need: ['弗兰奇', '弗兰奇', '罗罗诺亚索隆']
    },
    {
        name: '克洛克达尔 前任七武海',
        type: 3,
        need: ['弗兰奇', '狙击王乌索普', '巴基']
    },
    {
        name: '月光莫利亚',
        type: 3,
        need: ['布鲁克', '布鲁克', '山治']
    },
    {
        name: '贝鲁梅伯',
        type: 3,
        need: ['布鲁克', '罗罗诺亚索隆', '山治']
    },
    {
        name: '波特卡斯D艾斯 白胡子海贼团第二队队长',
        type: 3,
        need: ['波特卡斯D艾斯', '波特卡斯D艾斯', '乌索普']
    },
    {
        name: '甚平七武海',
        type: 3,
        need: ['波特卡斯D艾斯', 'CP9猫头鹰', '巴基']
    },
    {
        name: '恶龙鱼人海贼团船长',
        type: 3,
        need: ['小八', '小八', '蒙奇D路飞']
    },
    {
        name: '克洛船长 百计',
        type: 3,
        need: ['小八', '海军剑兵', '罗罗诺亚索隆']
    },
    {
        name: '斯库亚德 白胡子旗下大涡蜘蛛',
        type: 3,
        need: ['托尼托尼乔巴蓝波球强化', '弗兰奇', '娜美']
    },
    {
        name: '托尼托尼乔巴皮毛强化',
        type: 3,
        need: ['托尼托尼乔巴蓝波球强化', '依玛祖娜', '海军剑兵']
    },
    {
        name: '托尼托尼乔巴头脑强化',
        type: 3,
        need: ['托尼托尼乔巴蓝波球强化', '妮可罗宾', '巴基']
    },
    {
        name: '巴兹尔霍金斯',
        type: 3,
        need: ['佩罗娜', 'CP9布鲁诺', '乌索普']
    },
    {
        name: '尤斯塔斯基德',
        type: 3,
        need: ['佩罗娜', '培波', '巴基']
    },
    {
        name: '神艾尼路 空岛伪神',
        type: 3,
        need: ['狙击王乌索普', '培波', '山治']
    },
    {
        name: '乌索普 火炎弹',
        type: 3,
        need: ['狙击王乌索普', '狙击王乌索普']
    },
    {
        name: '阿布萨罗姆 透明人',
        type: 3,
        need: ['月光莫利亚', '娜美']
    }
]

const Pool4 = [
    {
        name: '蒙奇D路飞 三档',
        type: 4,
        need: ['蒙奇D路飞 二档', '神艾尼路 空岛伪神', '本萨姆Mr.2']
    },
    {
        name: '山治 恶魔风脚',
        type: 4,
        need: ['山治黑足', '托尼托尼乔巴皮毛强化', '尤斯塔斯基德']
    },
    {
        name: '索隆 赏金猎人',
        type: 4,
        need: ['罗罗诺亚索隆鬼气', '月光莫利亚', '斯摩格']
    },
    {
        name: '乔拉可尔米霍克',
        type: 4,
        need: ['罗罗诺亚索隆鬼气', '克洛船长 百计', 'X德雷克']
    },
    {
        name: '波雅汉库克',
        type: 4,
        need: ['娜美 天候棒', '恶龙鱼人海贼团船长', '蒙奇D路飞 二档']
    },
    {
        name: '克洛克达尔Mr.0 Sir',
        type: 4,
        need: ['克洛克达尔 前任七武海', '甚平七武海', '本萨姆Mr.2']
    },
    {
        name: '薇薇 Miss Wednesday',
        type: 4,
        need: ['加卡 阿拉巴斯坦守护神', '克洛克达尔 前任七武海', '娜美 天候棒']
    },
    {
        name: 'Bady-5 八宝水军',
        type: 4,
        need: ['海贼5号合体 巨大机器战士', '巴索罗缪熊', '罗布路奇 CP9 道力 4000']
    },
    {
        name: '战桃丸 海军科学部队队长',
        type: 4,
        need: ['巴索罗缪熊', '托尼托尼乔巴头脑强化', '卡彭匪帮贝基']
    },
    {
        name: '卡普 海军英雄',
        type: 4,
        need: ['斯摩格', '蒙奇D路飞 二档', 'X德雷克']
    },
    {
        name: '麦哲伦 毒毒果实能力者',
        type: 4,
        need: ['甚平七武海', '波特卡斯D艾斯 白胡子海贼团第二队队长', '巴基特制巴基炮弹']
    },
    {
        name: '鼹鼠 G1 支部首领',
        type: 4,
        need: ['甚平七武海', '斯摩格', '贝鲁梅伯']
    },
    {
        name: '马歇尔D蒂奇 白胡子海贼团叛徒',
        type: 4,
        need: ['波特卡斯D艾斯 白胡子海贼团第二队队长', '斯库亚德 白胡子旗下大涡蜘蛛', 'X德雷克']
    },
    {
        name: '萨卡斯基 海军队长 赤犬',
        type: 4,
        need: ['波特卡斯D艾斯 白胡子海贼团第二队队长', '依玛祖娜革命军', '克洛克达尔 前任七武海']
    },
    {
        name: '库赞 海军队长 青稚',
        type: 4,
        need: ['妮可罗宾 奥哈拉的恶魔', '神艾尼路 空岛伪神', '斯库亚德 白胡子旗下大涡蜘蛛']
    },
    {
        name: '波鲁萨利诺 海军队长',
        type: 4,
        need: ['贝鲁梅伯', '特拉法尔加罗', '尤斯塔斯基德']
    },
    {
        name: '卡库 CP9 牛牛果实 周断',
        type: 4,
        need: ['罗布路奇 CP9 道力 4000', '加卡 阿拉巴斯坦守护神', '妮可罗宾 奥哈拉的恶魔']
    },
    {
        name: '特拉法尔加罗 死亡外科医生',
        type: 4,
        need: ['特拉法尔加罗', '托尼托尼乔巴头脑强化', '海贼5号合体 巨大机器战士']
    },
    {
        name: '巴杰斯 黑胡子海贼团船员',
        type: 4,
        need: ['巴兹尔霍金斯', '马尔高 白胡子海贼团', '巴基特制巴基炮弹']
    },
    {
        name: '巴兹尔霍金斯 稻草人',
        type: 4,
        need: ['巴兹尔霍金斯', '特拉法尔加罗', '基拉']
    },
    {
        name: '魔人奥兹 大陆破坏者',
        type: 4,
        need: ['月光莫利亚', '月光莫利亚', '蒙奇D路飞 二档']
    },
    {
        name: '剑豪龙马 斩龙武士',
        type: 4,
        need: ['月光莫利亚', '罗罗诺亚索隆鬼气', '狙击王乌索普', '佩罗娜', '海军剑兵']
    },
    {
        name: '佩罗娜 灵灵果实-消极',
        type: 4,
        need: ['阿布萨罗姆 透明人', '佩罗娜', '托尼托尼乔巴头脑强化', '山治黑足']
    },
    {
        name: '砂糖 多弗朗明哥最高干部',
        type: 4,
        need: ['托尼托尼乔巴头脑强化', '罗罗诺亚索隆鬼气', '佩罗娜', '乌索普']
    },
    {
        name: '布鲁克 骷髅音乐家',
        type: 4,
        need: ['巴基特制巴基炮弹', '月光莫利亚', '罗布路奇 CP9 道力 4000']
    },
    {
        name: '多弗朗明哥 七武海',
        type: 4,
        need: ['托尼托尼乔巴皮毛强化', '罗布路奇 CP9 道力 4000', '巴基特制巴基炮弹']
    },
    {
        name: '托尼托尼乔巴 角力强化',
        type: 4,
        need: ['托尼托尼乔巴皮毛强化', '贝鲁梅伯', '特拉法尔加罗']
    },
    {
        name: '香克斯 红发海贼团船长',
        type: 4,
        need: ['巴基特制巴基炮弹', '乌索普 火炎弹', '蒙奇D路飞 二档']
    },
    {
        name: '本贝克曼 红发海贼团副船长',
        type: 4,
        need: ['乌索普 火炎弹', '斯摩格', '神艾尼路 空岛伪神']
    },
    {
        name: '乌索普 波音列岛幸存者',
        type: 4,
        need: ['乌索普 火炎弹', '卡彭匪帮贝基', '娜美 天候棒']
    },
    {
        name: '安步里奥伊万科夫',
        type: 4,
        need: ['依玛祖娜革命军', '妮可罗宾 奥哈拉的恶魔', '克洛克达尔 前任七武海']
    },
    {
        name: '萨博 革命军参谋',
        type: 4,
        need: ['依玛祖娜革命军', '巴索罗缪熊', '马尔高 白胡子海贼团']
    },
    {
        name: '马尔高 白胡子第一队队长',
        type: 4,
        need: ['马尔高 白胡子海贼团', '托尼托尼乔巴皮毛强化', '加卡 阿拉巴斯坦守护神']
    },
    {
        name: '乔兹 白胡子第三队队长 钻石',
        type: 4,
        need: ['斯库亚德 白胡子旗下大涡蜘蛛', '卡彭匪帮贝基', '克洛船长 百计']
    },
    {
        name: '巴托洛米奥 草帽海贼团疯狂粉丝',
        type: 4,
        need: ['克洛船长 百计', '恶龙鱼人海贼团船长', '海贼5号合体 巨大机器战士']
    },
    {
        name: '范德戴肯 飞翔的荷兰人号船长',
        type: 4,
        need: ['恶龙鱼人海贼团船长', '甚平七武海', '贝鲁梅伯']
    },
    {
        name: '瓦帕 空岛战鬼',
        type: 4,
        need: ['神艾尼路 空岛伪神', '乌索普 火炎弹', '山治黑足']
    },
    {
        name: '哲普 海上餐厅 师父',
        type: 4,
        need: ['本萨姆Mr.2', '依玛祖娜革命军', '巴兹尔霍金斯']
    },
    {
        name: '尤斯塔斯基德 船长-基德',
        type: 4,
        need: ['尤斯塔斯基德', '娜美 天候棒', '基拉']
    },
    {
        name: '锦卫门 和之国的武士',
        type: 4,
        need: ['基拉', '克洛船长 百计', '波特卡斯D艾斯 白胡子海贼团第二队队长']
    },
    {
        name: '希留 原推进城看守长',
        type: 4,
        need: ['卡彭匪帮贝基', 'X德雷克', '山治黑足']
    },
    {
        name: 'X德雷克 异特龙',
        type: 4,
        need: ['X德雷克', '巴兹尔霍金斯', '恶龙鱼人海贼团船长']
    }
]

const Pool5 = [
    {
        name: '月光莫利亚 影之集合地',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '蒙奇D路飞 噩梦',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '甚平 前任七武海鱼人族首领',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '斯摩格 专注的海军中将',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '蒙奇D龙 世界最凶恶的罪犯',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '波雅汉库克 九蛇海贼团船长',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '史基 金狮子',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '战国 原海军元帅',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '香克斯 四皇红发',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '爱德华纽盖特 四皇白胡子海贼团的父亲',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '文斯莫克蕾玖 绯红剧毒',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '卡尔加拉 香狄亚大战士',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '拉布 越过红土大陆的鲸鱼',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '巴托洛米奥 新锐超新星 食人鬼',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '罗罗诺亚索隆 死亡领域 狮子歌歌',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '罗布路奇 生命归还',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '山治 黑足西装套',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '克比 改变世界命运的海军新秀',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '滕虎一生 神海军队长',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '蒙奇D路飞 二档喷射机关枪',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '天月时 时间旅行者',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '马尔高 幻兽种 不死鸟',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '润 飞六胞',
        type: 5,
        need: ['', '', '']
    },
    {
        name: 'Dr.希鲁鲁克 治国医生',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '猫蝮蛇 黑夜之王',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '特拉法尔加罗 心脏海贼团船长',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '哥尔D艾斯 海贼王的儿子',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '泽法 原海军队长 黑腕',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '凯撒库朗 疯狂的科学家',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '娜美 小贼猫',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '马歇尔D蒂奇 黑胡子海贼团船长 黑胡子',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '巴索罗缪熊 暴君',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '夏洛特克力架 BIG MOM三将星',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '阿忍 迷人女忍者',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '烬 百兽海贼团 大看板',
        type: 5,
        need: ['', '', '']
    },
    {
        name: '西尔巴兹雷利 罗杰海贼团副船长',
        type: 5,
        need: ['', '', '']
    },
]

const Pool6 = [
    
]

const Pool7 = [

]

export const zHeroPool = [...Pool1, ...Pool2, ...Pool3, ...Pool4, ...Pool5, ...Pool6, ...Pool7];